rkz/extension/Documents/ЗаказНаПроизводство2_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказНаПроизводство2_2</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипПроизводственногоПроцесса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПроизводственныхПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовНаПроизводство2_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаПотребности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НачатьНеРанее</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ПереданВПроизводство</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Продукция</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоляСтоимости</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Отменено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПричинаОтмены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПричиныОтменыПроизводства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>АналитикаАктивовПассивов</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.СтатьиАктивовПассивов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РесурсныеСпецификации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоляСтоимостиНаЕдиницу</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СписатьНаРасходы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>АналитикаРасходов</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КлючНоменклатура</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

rkz/extension/InformationRegisters/бит_ЗначенияПризнаковНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>бит_ЗначенияПризнаковНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ПризнакиНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ПризнакСертификации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Признак</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ПризнакиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

rkz/extension/Documents/ЗаказНаПроизводство2_2/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&После("ДобавитьКомандыПечати")
Процедура бит_ДобавитьКомандыПечати(КомандыПечати)
	
// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] + 
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "бит_СуточныйЗапуск";
	КомандаПечати.Представление = НСтр("ru = '(бит) Суточный запуск'"); 
// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] -
	
КонецПроцедуры

&После("Печать")
Процедура бит_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	
// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] +
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "бит_СуточныйЗапуск");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		Заголовок = НСтр("ru = '(бит) Суточный запуск'");
		МодульУправлениеПечатью = ОбщегоНазначения.ОбщийМодуль("УправлениеПечатью");
		МодульУправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
				КоллекцияПечатныхФорм,
				"бит_СуточныйЗапуск", 
				Заголовок,
				бит_СформироватьПечатнуюФормуСуточныйЗапуск(МассивОбъектов),
				,
				"Документ.ЗаказНаПроизводство2_2.бит_ПФ_MXL_СуточныйЗапуск");
	КонецЕсли; 
// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] -

КонецПроцедуры   

Функция бит_СформироватьПечатнуюФормуСуточныйЗапуск(МассивОбъектов)
	
// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] +

	УстановитьПривилегированныйРежим(Истина); 
	
	СправочникЗанченияПоУмолчанию = Справочники.бит_ЗначенияПоУмолчанию;
	
	ВидИсполнения 	= СправочникЗанченияПоУмолчанию.ПолучитьМассивЗначений(СправочникЗанченияПоУмолчанию.ПризнакВидИсполненияГотовойПродукции, Неопределено, Истина); 
	Сечение	 		= СправочникЗанченияПоУмолчанию.ПолучитьМассивЗначений(СправочникЗанченияПоУмолчанию.ПризнакРазмерГотовойПродукции, Неопределено, Истина); 
	ТоннажCu 		= СправочникЗанченияПоУмолчанию.ПолучитьМассивЗначений(СправочникЗанченияПоУмолчанию.ПризнакМедь, Неопределено, Истина); 
	ТоннажAl 		= СправочникЗанченияПоУмолчанию.ПолучитьМассивЗначений(СправочникЗанченияПоУмолчанию.ПризнакАлюминий, Неопределено, Истина);
	
	ПараметрыПечати = ИСТИНА;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ПолеСлева = 5;
	ТабличныйДокумент.ПолеСправа = 5;
	ТабличныйДокумент.РазмерКолонтитулаСверху = 0;
	ТабличныйДокумент.РазмерКолонтитулаСнизу = 0;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ТабличныйДокумент.КлючПараметровПечати = "бит_СуточныйЗапуск";
	
	Макет = ПолучитьМакет("бит_ПФ_MXL_СуточныйЗапуск");
	
	ОбластьЗаголовок 		= Макет.ПолучитьОбласть("Заголовок");   
	ОбластьШапкаТаблицы 	= Макет.ПолучитьОбласть("ШапкаТаблицы"); 
	ОбластьСтрокаСклад 		= Макет.ПолучитьОбласть("СтрокаСклад"); 
	ОбластьСтрокаТаблицы 	= Макет.ПолучитьОбласть("СтрокаТаблицы");  
	ОбластьСтрокаИтог 		= Макет.ПолучитьОбласть("СтрокаИтог"); 
	
	Запрос = Новый Запрос("
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИСТИНА КАК НеВключатьВСуточныйПакет,
		|	Номенклатура.Ссылка КАК Номенклатура
		|ПОМЕСТИТЬ вт_НоменклатураНеВСуточномПакете
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_НеВключатьВСуточныйПакет КАК бит_НеВключатьВСуточныйПакет
		|		ПО (Номенклатура.Родитель = бит_НеВключатьВСуточныйПакет.бит_ГруппаНоменклатуры
		|				ИЛИ Номенклатура.Родитель.Родитель = бит_НеВключатьВСуточныйПакет.бит_ГруппаНоменклатуры
		|				ИЛИ Номенклатура.Родитель.Родитель.Родитель = бит_НеВключатьВСуточныйПакет.бит_ГруппаНоменклатуры
		|				ИЛИ Номенклатура.Родитель.Родитель.Родитель.Родитель = бит_НеВключатьВСуточныйПакет.бит_ГруппаНоменклатуры)
		|ГДЕ
		|	НЕ бит_НеВключатьВСуточныйПакет.ПометкаУдаления
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказНаПроизводство2_2Продукция.Ссылка КАК Ссылка,
		|	ЗаказНаПроизводство2_2Продукция.НомерСтроки КАК НомерСтроки,
		|	ЗаказНаПроизводство2_2Продукция.Номенклатура КАК Номенклатура,
		|	ЗаказНаПроизводство2_2Продукция.Характеристика КАК Характеристика,
		|	ЗаказНаПроизводство2_2Продукция.Упаковка КАК Упаковка,
		|	ЗаказНаПроизводство2_2Продукция.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ЗаказНаПроизводство2_2Продукция.Количество КАК Количество,
		|	ЗаказНаПроизводство2_2Продукция.Спецификация КАК Спецификация,
		|	ЗаказНаПроизводство2_2Продукция.Склад КАК Склад,
		|	ЗаказНаПроизводство2_2Продукция.Подразделение КАК Подразделение,
		|	вт_НоменклатураНеВСуточномПакете.НеВключатьВСуточныйПакет КАК НеВключатьВСуточныйПакет
		|ПОМЕСТИТЬ вт_ЗаказНаПроизводствоПродукция
		|ИЗ
		|	Документ.ЗаказНаПроизводство2_2.Продукция КАК ЗаказНаПроизводство2_2Продукция
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_НоменклатураНеВСуточномПакете КАК вт_НоменклатураНеВСуточномПакете
		|		ПО ЗаказНаПроизводство2_2Продукция.Номенклатура = вт_НоменклатураНеВСуточномПакете.Номенклатура
		|ГДЕ
		|	ЗаказНаПроизводство2_2Продукция.Ссылка В(&МассивОбъектов)
		|	И ЕСТЬNULL(вт_НоменклатураНеВСуточномПакете.НеВключатьВСуточныйПакет, 0) = 0
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка,
		|	Спецификация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЭтапыПроизводства.Владелец КАК Владелец,
		|	ЭтапыПроизводства.Подразделение КАК Подразделение
		|ПОМЕСТИТЬ вт_ЗаключительныеЭтапыПроизводства
		|ИЗ
		|	вт_ЗаказНаПроизводствоПродукция КАК вт_ЗаказНаПроизводствоПродукция
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
		|		ПО вт_ЗаказНаПроизводствоПродукция.Спецификация = ЭтапыПроизводства.Владелец
		|ГДЕ
		|	ЭтапыПроизводства.НомерСледующегоЭтапа = 0
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Владелец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ЗаключительныеЭтапыПроизводства.Подразделение.Наименование КАК ПодразделениеПредставление,
		|	СпрНоменклатура.Марка КАК Марка,
		|	СпрНоменклатура.Представление КАК НоменклатураПредставление,
		|	ВЫБОР
		|		КОГДА вт_ЗаказНаПроизводствоПродукция.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяССылка)
		|			ТОГДА СпрНоменклатура.ЕдиницаИзмерения
		|		ИНАЧЕ вт_ЗаказНаПроизводствоПродукция.Упаковка
		|	КОНЕЦ КАК ЕдИзм,
		|	ВЫБОР
		|		КОГДА вт_ЗаказНаПроизводствоПродукция.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяССылка)
		|			ТОГДА вт_ЗаказНаПроизводствоПродукция.Количество
		|		ИНАЧЕ вт_ЗаказНаПроизводствоПродукция.КоличествоУпаковок
		|	КОНЕЦ КАК Количество,
		|	ЗаказНаПроизводство2_2.бит_ПереданВПроизводство КАК ДатаЗапуска,
		|	ЗаказНаПроизводство2_2.Комментарий КАК ПримечаниеКЗаказу,
		|	СпрНоменклатура.Артикул КАК КодАртикул,
		|	СпрНоменклатура.Ссылка КАК НоменклатураСсылка,
		|	ЗаказНаПроизводство2_2.ДокументОснование КАК ДокументОснование
		|ПОМЕСТИТЬ вт_ВыборкаБезЗаказовКлиентовДавальцев
		|ИЗ
		|	Документ.ЗаказНаПроизводство2_2 КАК ЗаказНаПроизводство2_2
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_ЗаказНаПроизводствоПродукция КАК вт_ЗаказНаПроизводствоПродукция
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
		|			ПО вт_ЗаказНаПроизводствоПродукция.Номенклатура = СпрНоменклатура.Ссылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ вт_ЗаключительныеЭтапыПроизводства КАК вт_ЗаключительныеЭтапыПроизводства
		|			ПО вт_ЗаказНаПроизводствоПродукция.Спецификация = вт_ЗаключительныеЭтапыПроизводства.Владелец
		|		ПО ЗаказНаПроизводство2_2.Ссылка = вт_ЗаказНаПроизводствоПродукция.Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДокументОснование,
		|	НоменклатураСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ЗаказКлиентаТовары.ДатаОтгрузки) КАК ДатаОтгрузкиТоваров,
		|	ЗаказКлиентаТовары.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ вт_МаксимумДатыОтгрузкиЗаказКлиентаДавальца
		|ИЗ
		|	вт_ЗаказНаПроизводствоПродукция КАК вт_ЗаказНаПроизводствоПродукция
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ПО вт_ЗаказНаПроизводствоПродукция.Ссылка.ДокументОснование = ЗаказКлиентаТовары.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиентаТовары.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МАКСИМУМ(ЗаказДавальца2_5Продукция.ДатаОтгрузки),
		|	ЗаказДавальца2_5Продукция.Ссылка
		|ИЗ
		|	вт_ЗаказНаПроизводствоПродукция КАК вт_ЗаказНаПроизводствоПродукция
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказДавальца2_5.Продукция КАК ЗаказДавальца2_5Продукция
		|		ПО вт_ЗаказНаПроизводствоПродукция.Ссылка.ДокументОснование = ЗаказДавальца2_5Продукция.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказДавальца2_5Продукция.Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_МаксимумДатыОтгрузкиЗаказКлиентаДавальца.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА ЗаказКлиента.ДатаОтгрузки > вт_МаксимумДатыОтгрузкиЗаказКлиентаДавальца.ДатаОтгрузкиТоваров
		|			ТОГДА ЗаказКлиента.ДатаОтгрузки
		|		ИНАЧЕ вт_МаксимумДатыОтгрузкиЗаказКлиентаДавальца.ДатаОтгрузкиТоваров
		|	КОНЕЦ КАК МаксимальнаяДатаОтгрузки,
		|	ЗаказКлиента.Номер КАК Номер,
		|	ЗаказКлиента.бит_Толеранс КАК бит_Толеранс
		|ПОМЕСТИТЬ вт_ЗаказыКлиентовДавальцев
		|ИЗ
		|	вт_МаксимумДатыОтгрузкиЗаказКлиентаДавальца КАК вт_МаксимумДатыОтгрузкиЗаказКлиентаДавальца
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
		|		ПО вт_МаксимумДатыОтгрузкиЗаказКлиентаДавальца.Ссылка = ЗаказКлиента.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	вт_МаксимумДатыОтгрузкиЗаказКлиентаДавальца.Ссылка,
		|	ВЫБОР
		|		КОГДА ЗаказДавальца2_5.ДатаОтгрузки > вт_МаксимумДатыОтгрузкиЗаказКлиентаДавальца.ДатаОтгрузкиТоваров
		|			ТОГДА ЗаказДавальца2_5.ДатаОтгрузки
		|		ИНАЧЕ вт_МаксимумДатыОтгрузкиЗаказКлиентаДавальца.ДатаОтгрузкиТоваров
		|	КОНЕЦ,
		|	ЗаказДавальца2_5.Номер + "" (Дав)"",
		|	ЗаказДавальца2_5.бит_Толеранс
		|ИЗ
		|	вт_МаксимумДатыОтгрузкиЗаказКлиентаДавальца КАК вт_МаксимумДатыОтгрузкиЗаказКлиентаДавальца
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказДавальца2_5 КАК ЗаказДавальца2_5
		|		ПО вт_МаксимумДатыОтгрузкиЗаказКлиентаДавальца.Ссылка = ЗаказДавальца2_5.Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ЗаказНаПроизводствоПродукция.Номенклатура КАК Номенклатура,
		|	бит_ЗначенияПризнаковНоменклатуры.бит_Значение КАК Сечение
		|ПОМЕСТИТЬ вт_Сечение
		|ИЗ
		|	вт_ЗаказНаПроизводствоПродукция КАК вт_ЗаказНаПроизводствоПродукция
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ЗначенияПризнаковНоменклатуры КАК бит_ЗначенияПризнаковНоменклатуры
		|		ПО (вт_ЗаказНаПроизводствоПродукция.Номенклатура = бит_ЗначенияПризнаковНоменклатуры.бит_Номенклатура)
		|ГДЕ
		|	бит_ЗначенияПризнаковНоменклатуры.бит_Признак = &Сечение
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ЗаказНаПроизводствоПродукция.Номенклатура КАК Номенклатура,
		|	СУММА(ВЫРАЗИТЬ(бит_ЗначенияПризнаковНоменклатуры.бит_Значение КАК ЧИСЛО(15, 5))) КАК ТоннажCu
		|ПОМЕСТИТЬ вт_ТоннажCu
		|ИЗ
		|	вт_ЗаказНаПроизводствоПродукция КАК вт_ЗаказНаПроизводствоПродукция
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ЗначенияПризнаковНоменклатуры КАК бит_ЗначенияПризнаковНоменклатуры
		|		ПО (вт_ЗаказНаПроизводствоПродукция.Номенклатура = бит_ЗначенияПризнаковНоменклатуры.бит_Номенклатура)
		|ГДЕ
		|	бит_ЗначенияПризнаковНоменклатуры.бит_Признак = &ТоннажCu
		|
		|СГРУППИРОВАТЬ ПО
		|	вт_ЗаказНаПроизводствоПродукция.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ЗаказНаПроизводствоПродукция.Номенклатура КАК Номенклатура,
		|	СУММА(ВЫРАЗИТЬ(бит_ЗначенияПризнаковНоменклатуры.бит_Значение КАК ЧИСЛО(15, 5))) КАК ТоннажAl
		|ПОМЕСТИТЬ вт_ТоннажAl
		|ИЗ
		|	вт_ЗаказНаПроизводствоПродукция КАК вт_ЗаказНаПроизводствоПродукция
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ЗначенияПризнаковНоменклатуры КАК бит_ЗначенияПризнаковНоменклатуры
		|		ПО (вт_ЗаказНаПроизводствоПродукция.Номенклатура = бит_ЗначенияПризнаковНоменклатуры.бит_Номенклатура)
		|ГДЕ
		|	бит_ЗначенияПризнаковНоменклатуры.бит_Признак = &ТоннажAl
		|
		|СГРУППИРОВАТЬ ПО
		|	вт_ЗаказНаПроизводствоПродукция.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ЗаказНаПроизводствоПродукция.Номенклатура КАК Номенклатура,
		|	бит_ЗначенияПризнаковНоменклатуры.бит_Значение КАК ВидИсполнения
		|ПОМЕСТИТЬ вт_ВидИсполнения
		|ИЗ
		|	вт_ЗаказНаПроизводствоПродукция КАК вт_ЗаказНаПроизводствоПродукция
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ЗначенияПризнаковНоменклатуры КАК бит_ЗначенияПризнаковНоменклатуры
		|		ПО (вт_ЗаказНаПроизводствоПродукция.Номенклатура = бит_ЗначенияПризнаковНоменклатуры.бит_Номенклатура)
		|ГДЕ
		|	бит_ЗначенияПризнаковНоменклатуры.бит_Признак = &ВидИсполнения
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(вт_ЗаказыКлиентовДавальцев.Номер, 0) = 0
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьЗаказ,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(вт_ВыборкаБезЗаказовКлиентовДавальцев.ПодразделениеПредставление, 0) = 0
		|			ТОГДА ""Подразделение не указано""
		|		ИНАЧЕ вт_ВыборкаБезЗаказовКлиентовДавальцев.ПодразделениеПредставление
		|	КОНЕЦ КАК ПодразделениеНаименование,
		|	вт_ЗаказыКлиентовДавальцев.Номер КАК Номер,
		|	вт_ВыборкаБезЗаказовКлиентовДавальцев.Марка КАК Марка,
		|	вт_ВыборкаБезЗаказовКлиентовДавальцев.НоменклатураПредставление КАК НоменклатураПредставление,
		|	вт_ВыборкаБезЗаказовКлиентовДавальцев.ЕдИзм КАК ЕдИзм,
		|	СУММА(вт_ВыборкаБезЗаказовКлиентовДавальцев.Количество) КАК Количество,
		|	вт_ВыборкаБезЗаказовКлиентовДавальцев.ДатаЗапуска КАК ДатаЗапуска,
		|	ВЫРАЗИТЬ(вт_ВыборкаБезЗаказовКлиентовДавальцев.ПримечаниеКЗаказу КАК СТРОКА(150)) КАК ПримечаниеКЗаказу,
		|	вт_ЗаказыКлиентовДавальцев.МаксимальнаяДатаОтгрузки КАК МаксимальнаяДатаОтгрузки,
		|	ЗаказКлиентаТовары.ДатаОтгрузки КАК ДатаОтгрузки,
		|	вт_ЗаказыКлиентовДавальцев.бит_Толеранс КАК бит_Толеранс,
		|	вт_ВыборкаБезЗаказовКлиентовДавальцев.КодАртикул КАК КодАртикул,
		|	вт_ВидИсполнения.ВидИсполнения КАК ВидИсполнения,
		|	вт_Сечение.Сечение КАК Сечение,
		|	вт_ТоннажAl.ТоннажAl КАК ТоннажAl,
		|	вт_ТоннажCu.ТоннажCu КАК ТоннажCu
		|ИЗ
		|	вт_ВыборкаБезЗаказовКлиентовДавальцев КАК вт_ВыборкаБезЗаказовКлиентовДавальцев
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ЗаказыКлиентовДавальцев КАК вт_ЗаказыКлиентовДавальцев
		|		ПО вт_ВыборкаБезЗаказовКлиентовДавальцев.ДокументОснование = вт_ЗаказыКлиентовДавальцев.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ПО вт_ВыборкаБезЗаказовКлиентовДавальцев.ДокументОснование = ЗаказКлиентаТовары.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_Сечение КАК вт_Сечение
		|		ПО вт_ВыборкаБезЗаказовКлиентовДавальцев.НоменклатураСсылка = вт_Сечение.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ТоннажCu КАК вт_ТоннажCu
		|		ПО вт_ВыборкаБезЗаказовКлиентовДавальцев.НоменклатураСсылка = вт_ТоннажCu.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ТоннажAl КАК вт_ТоннажAl
		|		ПО вт_ВыборкаБезЗаказовКлиентовДавальцев.НоменклатураСсылка = вт_ТоннажAl.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ВидИсполнения КАК вт_ВидИсполнения
		|		ПО вт_ВыборкаБезЗаказовКлиентовДавальцев.НоменклатураСсылка = вт_ВидИсполнения.Номенклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	вт_ЗаказыКлиентовДавальцев.Номер,
		|	вт_ВыборкаБезЗаказовКлиентовДавальцев.Марка,
		|	вт_ВыборкаБезЗаказовКлиентовДавальцев.НоменклатураПредставление,
		|	вт_ВыборкаБезЗаказовКлиентовДавальцев.ЕдИзм,
		|	вт_ВыборкаБезЗаказовКлиентовДавальцев.ДатаЗапуска,
		|	вт_ЗаказыКлиентовДавальцев.МаксимальнаяДатаОтгрузки,
		|	ЗаказКлиентаТовары.ДатаОтгрузки,
		|	вт_ЗаказыКлиентовДавальцев.бит_Толеранс,
		|	вт_ВыборкаБезЗаказовКлиентовДавальцев.КодАртикул,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(вт_ВыборкаБезЗаказовКлиентовДавальцев.ПодразделениеПредставление, 0) = 0
		|			ТОГДА ""Подразделение не указано""
		|		ИНАЧЕ вт_ВыборкаБезЗаказовКлиентовДавальцев.ПодразделениеПредставление
		|	КОНЕЦ,
		|	ВЫРАЗИТЬ(вт_ВыборкаБезЗаказовКлиентовДавальцев.ПримечаниеКЗаказу КАК СТРОКА(150)),
		|	вт_ВидИсполнения.ВидИсполнения,
		|	вт_Сечение.Сечение,
		|	вт_ТоннажAl.ТоннажAl,
		|	вт_ТоннажCu.ТоннажCu
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЕстьЗаказ УБЫВ,
		|	ПодразделениеНаименование,
		|	Номер
		|ИТОГИ ПО
		|	ЕстьЗаказ,
		|	ПодразделениеНаименование");


	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ВидИсполнения", ВидИсполнения);
	Запрос.УстановитьПараметр("Сечение", Сечение);
	Запрос.УстановитьПараметр("ТоннажAl", ТоннажAl);
	Запрос.УстановитьПараметр("ТоннажCu", ТоннажCu);
	РезультатЗапроса = Запрос.Выполнить();  
	
	ПервыйДокумент = ИСТИНА;
	
	ВыборкаЕстьЗаказ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ЕстьЗаказ");
	Пока ВыборкаЕстьЗаказ.Следующий() Цикл //ЗАКАЗ
		
		Если ПервыйДокумент Тогда
			ПервыйДокумент = ЛОЖЬ;
		Иначе
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;	
			
		ОбластьЗаголовок.Параметры.ТекущаяДата	= Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
		ОбластьЗаголовок.Параметры.ТекущееВремя = Формат(ТекущаяДата(), "ДЛФ=T");
		
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
		
		ВыборкаПодразделение = ВыборкаЕстьЗаказ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ПодразделениеНаименование"); 
		Пока ВыборкаПодразделение.Следующий() Цикл //ПОДРАЗДЕЛЕНИЕ
			
			ОбластьСтрокаИтог.Параметры.ИтогоКоличествоКмТ 	= ВыборкаПодразделение.Количество;
			ОбластьСтрокаИтог.Параметры.ИтогоТоннажCU 		= ВыборкаПодразделение.ТоннажCU;
			ОбластьСтрокаИтог.Параметры.ИтогоТоннажAI 		= ВыборкаПодразделение.ТоннажAl;
			
			ОбластьСтрокаСклад.Параметры.Подразделение = ВыборкаПодразделение.ПодразделениеНаименование;
	
			ТабличныйДокумент.Вывести(ОбластьСтрокаСклад);
			
			Выборка = ВыборкаПодразделение.Выбрать();
			Пока Выборка.Следующий() Цикл //ВЫБОРКА
				
				ОбластьСтрокаТаблицы.Параметры.ЗаказНомер 		= ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Номер, Истина, Ложь); 
				ОбластьСтрокаТаблицы.Параметры.Номенклатура		= Выборка.НоменклатураПредставление; 
				ОбластьСтрокаТаблицы.Параметры.Марка 			= Выборка.Марка;  
				ОбластьСтрокаТаблицы.Параметры.Сечение 			= Выборка.Сечение;
				ОбластьСтрокаТаблицы.Параметры.ЕдИзм 			= Выборка.ЕдИзм;
				ОбластьСтрокаТаблицы.Параметры.ВидИсполнения 	= Выборка.ВидИсполнения;
				ОбластьСтрокаТаблицы.Параметры.КоличествоКмТ 	= Выборка.Количество;
				ОбластьСтрокаТаблицы.Параметры.ДатаЗапуска 		= Формат(Выборка.ДатаЗапуска, "ДФ=dd.MM.yyyy");
				ОбластьСтрокаТаблицы.Параметры.ТоннажCU 		= Выборка.ТоннажCU;
				ОбластьСтрокаТаблицы.Параметры.ТоннажAI 		= Выборка.ТоннажAl; 
				ОбластьСтрокаТаблицы.Параметры.ЗаказПримечание 	= Выборка.ПримечаниеКЗаказу;
				ОбластьСтрокаТаблицы.Параметры.Срок 			= Формат(Выборка.МаксимальнаяДатаОтгрузки, "ДФ=dd.MM.yyyy");
				ОбластьСтрокаТаблицы.Параметры.КлиентскийСрок 	= Формат(Выборка.ДатаОтгрузки, "ДФ=dd.MM.yyyy"); 
				ОбластьСтрокаТаблицы.Параметры.Толеранс			= Выборка.бит_Толеранс;
				ОбластьСтрокаТаблицы.Параметры.Код 				= Выборка.КодАртикул;
				
				ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);

			КонецЦикла;
			
			ТабличныйДокумент.Вывести(ОбластьСтрокаИтог); 
						
		КонецЦикла;	
	КонецЦикла; 
	
	Возврат ТабличныйДокумент;  
	
// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] -
	
КонецФункции

#КонецЕсли
